<template>
    <section class="about">
        <AboutBanner :banner_pics="banner_pics"/>
        <AboutFirst 
            subtitle="В 2005 году руководству компании пришла идея создания интернет-магазина" 
            text="Наша компания - надежный ювелирный интернет-магазин, который работает с 2005 года. 
            За это время мы заслужили доверие тысяч покупателей благодаря высокому качеству продукции, внимательному обслуживанию и широкому ассортименту ювелирных изделий.
            В нашем каталоге вы найдете элегантные кольца, серьги, браслеты и другие украшения из белого и желтого золота с натуральными драгоценными камнями.
            Мы стремимся сделать покупку ювелирных изделий удобной, безопасной и приятной, предлагая только проверенную продукцию от надежных производителей. Ваше сияние - наша главная ценность!"
        />
        <AboutSlider title="Принимаем участие в ежегодной ювелирной выставке Junwex" :slider="slider"/>
        <AboutTest title="Проверка подлинности украшений" :about_texts="about_texts"/>
        <AboutPartner title="Наши партнёры" :partners="partners" />
        <MainChoice />
    </section>
</template>

<script setup>
    const banner_pics = ref([
        {
            pic: '/images/about/banner_pic1.png'
        },
        {
            pic: '/images/about/banner_pic2.png'
        },
        {
            pic: '/images/about/banner_pic3.png'
        }
    ]);

    const slider = ref([
        {
            src: '/images/main-banner/pic.png',
            alt: 'pic',
            text: 'у нас появился веб-сайт, много новых партнеров, и мы запускаем собственное производство'
        },
        {
            src: '/images/main-banner/pic.png',
            alt: 'pic',
            text: 'у нас появился веб-сайт, много новых партнеров, и мы запускаем собственное производство'
        },
        {
            src: '/images/main-banner/pic.png',
            alt: 'pic',
            text: 'у нас появился веб-сайт, много новых партнеров, и мы запускаем собственное производство'
        },
        {
            src: '/images/main-banner/pic.png',
            alt: 'pic',
            text: 'у нас появился веб-сайт, много новых партнеров, и мы запускаем собственное производство'
        },
        {
            src: '/images/main-banner/pic.png',
            alt: 'pic',
            text: 'у нас появился веб-сайт, много новых партнеров, и мы запускаем собственное производство'
        },
        {
            src: '/images/main-banner/pic.png',
            alt: 'pic',
            text: 'у нас появился веб-сайт, много новых партнеров, и мы запускаем собственное производство'
        },
        {
            src: '/images/main-banner/pic.png',
            alt: 'pic',
            text: 'у нас появился веб-сайт, много новых партнеров, и мы запускаем собственное производство'
        },
    ]);

    const partners = ref([
        {
            country: 'Россия',
            title: 'КАБАРОВСКИЙ',
            text: 'Kabarovsky - российский ювелирный бренд, предлагающий стильные и высококачественные украшения из золота, серебра и платины. В коллекциях представлены кольца, серьги, кулоны и браслеты с натуральными камнями, такими как бриллианты, рубины и изумруды. Бренд фокусируется на элегантном дизайне, сочетающем классику и современные тенденции, с акцентом на долговечность и комфорт.',
            pic: '/images/about/partner1.png'
        },
        {
            country: 'Россия',
            title: 'Соколов',
            text: 'Sokolov - один из ведущих российских ювелирных брендов, основанный в 1993 году. Специализируется на создании элегантных ювелирных изделий из золота, серебра и платины с бриллиантами и другими драгоценными камнями. Бренд известен доступными ценами, широким ассортиментом колец, серег, браслетов и цепочек, а также высоким качеством и современным дизайном, подходящим как для повседневной носки, так и для особых случаев.',
            pic: '/images/about/partner2.png'
        },
        {
            country: 'Россия',
            title: 'ПЛАТИНА',
            text: 'Ювелирный бренд премиум-класса Sunlight Group, специализирующийся на ювелирных изделиях из платины, золота и серебра. Коллекции включают эксклюзивные кольца, серьги, ожерелья и браслеты с бриллиантами и редкими камнями. Бренд ценит роскошь и мастерство исполнения, предлагая уникальные дизайны для тех, кто ищет изысканные украшения высокого качества и эстетической ценности.',
            pic: '/images/about/partner3.png'
        },
        {
            country: 'Россия',
            title: 'Дельта',
            text: 'Динамично развивающийся ювелирный бренд, предлагающий стильные украшения из золота и серебра со вставками из драгоценных камней. Коллекции включают кольца, серьги и браслеты в современном дизайне, сочетающем минимализм и элегантность. Бренд подходит для тех, кто ценит качество и доступность в повседневных аксессуарах.',
            pic: '/images/about/partner4.png'
        },
        {
            country: 'Россия',
            title: 'Алькор',
            text: 'Российский ювелирный бренд, специализирующийся на золотых и серебряных украшениях с натуральными камнями. В ассортименте представлены кольца, серьги, кулоны и цепочки, выполненные в классическом и современном стиле. Бренд известен надежностью, разнообразием дизайна и акцентом на комфорт и долговечность.',
            pic: '/images/about/partner5.png'
        },
        {
            country: 'Россия',
            title: 'ВЕСНА',
            text: 'Российский ювелирный бренд, специализирующийся на производстве элегантных украшений из золота, серебра и платины с натуральными камнями. В ассортименте представлены кольца, серьги и браслеты в изысканном и стильном дизайне. Бренд ценит качество, доступность и подходит для повседневной носки и подарков.',
            pic: '/images/about/partner6.png'
        },
        {
            country: 'Россия',
            title: 'Corona',
            text: 'Итальянский ювелирный бренд, известный роскошными украшениями из золота, платины и серебра с бриллиантами и цветными камнями. Коллекции включают ожерелья, кольца и браслеты элегантного и утонченного дизайна. Бренд подчеркивает мастерство изготовления и подходит для ценителей ювелирных изделий премиум-класса.',
            pic: '/images/about/partner7.png'
        },
        {
            country: 'Россия',
            title: 'Bellissima Tentazione',
            text: 'Итальянский бренд, предлагающий соблазнительные и романтичные украшения из золота и серебра с драгоценными камнями. Коллекции включают кольца, серьги и подвески с акцентом на женственность и страсть. Бренд идеально подходит для тех, кто ищет уникальные аксессуары, сочетающие в себе красоту и эмоциональность.',
            pic: '/images/about/partner8.png'
        },
    ]);

    const about_texts = ref([
        {
            text: 'В Magic Diamond мы по-настоящему ценим ювелирные изделия и работаем только с проверенными производителями. Именно поэтому все наши ювелирные изделия проходят строгую процедуру внесения в государственную систему учета оборота ювелирных украшений (ГИИС ДМДК). Это не только гарантирует превосходное качество и аутентичность нашей продукции, но и предоставляет клиентам полную открытость и стабильность. '
        },
        {
            text: 'Каждое украшение из нашего интернет-магазина — не просто аксессуар, а залог вашей уверенности в его превосходстве и уникальности.'
        },
        {
            text: 'На каждом нашем продукте прикреплена этикетка с индивидуальным идентификационным номером (УИН). Индивидуальный идентификационный номер (УИН) ювелирного изделия — это значимая деталь, помогающая удостовериться в происхождении товара.'
        },
    ])
</script>

<style scoped>

</style>